PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
    rtos_osLeaveCriticalSection(msr);

} /* invalidateDCache */


/**
 * Check if a quad-page is blank.
 */
static inline bool isQuadPageBlank(uint32_t addrOfQuadPage)
{
    assert(EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(addrOfQuadPage) == 0u);
    _Static_assert( EAP_C55FMC_SIZE_OF_QUAD_PAGE / sizeof(uint64_t) == 16u
                    &&  EAP_C55FMC_SIZE_OF_QUAD_PAGE % sizeof(uint64_t) == 0u
                  , "Bad implementation of blank check"
                  );
    const volatile uint64_t *pRd = (const volatile uint64_t*)addrOfQuadPage;
#if 0
    const unsigned int noDWords = EAP_C55FMC_SIZE_OF_QUAD_PAGE/sizeof(uint64_t);
    for(unsigned int idxDWd=0u; idxDWd<noDWords; ++idxDWd, ++pRd)
        if(*pRd != 0xFFFFFFFFFFFFFFFFull)
            return false;
#else
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
#endif

    assert((uint32_t)pRd == addrOfQuadPage + EAP_C55FMC_SIZE_OF_QUAD_PAGE);
    return true;

} /* isQuadPageBlank */


/**
 * Check if the falsh ROM contents of a quad-page are identical to some expected data.
 *   @return
 * Get \a true if the flash ROM contains the data in \a pPrgDataBuf->data_b. Get \a
 * false in case of any deviation.
 *   @param[in] pPrgDataBuf
 * A data buffer by reference, which conatins the expected contents of a quad-page.
 */
static bool verifyQuadPage(const eap_quadPageProgramBuffer_t * const pPrgDataBuf)
{
    assert( pPrgDataBuf != NULL
            &&  EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pPrgDataBuf->address) == 0u
          );
    _Static_assert( EAP_C55FMC_SIZE_OF_QUAD_PAGE / sizeof(uint64_t) == 16u
                    &&  EAP_C55FMC_SIZE_OF_QUAD_PAGE % sizeof(uint64_t) == 0u
                  , "Bad implementation of verify"
                  );
    const volatile uint64_t *pFlash = (const volatile uint64_t*)pPrgDataBuf->address;
    const uint64_t *pExptd = &pPrgDataBuf->data_u64[0];

    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;

    assert((uint32_t)pFlash == (uint32_t)pPrgDataBuf->address + EAP_C55FMC_SIZE_OF_QUAD_PAGE);
    return true;

} /* verifyQuadPage */



/**
 * This function stops all erase and program activities of the C55FMC.\n
 *   It can be called in case of errors or unexpected states.
 */
static void abortEraseAndProgram(void)
{
    /* The mode of operation bits are disabled in distinct steps. This is a rule from
       the bit locking. RM48, 74.6, Table 74-3, p.3679. */
    // TODO Abortion is likely not properly implemented. Compare conditions RM48, 74.5.1, p.3656, for resetting EHV. However, seems to affect only modes, we don't use anyway
    C55FMC->MCR &= ~C55FMC_MCR_PSUS_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_ESUS_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_EHV_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_PGM_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_ERS_MASK;

    /* Now we can restore the default settings for accesibility of the flash blocks. */
    disableAllFlashBlocks();

} /* abortEraseAndProgram */


/**
 * Initialize the flash ROM driver.
 */
void eap_osInitFlashRomDriver(void)
{
    abortEraseAndProgram();

#ifdef DEBUG
    for(unsigned int idxBlk=0u; idxBlk<sizeOfAry(flashBlockDescAry); ++idxBlk)
    {
        const flashBlockDesc_t * const pBlkDesc = &flashBlockDescAry[idxBlk];

        /* The flash driver generally doesn't consider overflow in address calculations and
           it uses end addresses exclusively. This make the code fail for architectures,
           which have a flash ROM block at the very end of the implementation range of
           address variables, which uses type uint32_t. The end address of such a block
           would become 0 - which could be correct but which is simply not supported. (If
           your architecture by accident has such a flash block then the easiest way out
           would be sacrificing the last page of that block.) */
        assert(pBlkDesc->addrTo > 0u);

        /* A flash block must not be empty. */
        assert(pBlkDesc->addrFrom < pBlkDesc->addrTo);

        /* A flash-block must begin and end on a quad-page boundary. */
        assert(EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pBlkDesc->addrFrom) == 0u
               &&  EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pBlkDesc->addrTo) == 0u
              );

        /* We have 4 lock and select registers. */
        assert(pBlkDesc->idxLockReg < 4u);

        /* Each flash block is represented by excately one bit in these registers. */
        #define HAS_ONE_BIT_SET(x)  ((x)!=0u && ((x)&((x)-1u))==0u)
        assert(HAS_ONE_BIT_SET(pBlkDesc->bitMaskLockReg));
        #undef HAS_ONE_BIT_SET

# if defined(MCU_MPC5748G)
        /* For the MPC5748G, the implementation of the address range validity is based on
           the fact, that all flash blocks form a single, contiguous address space. Gaps
           are not considered. */
        assert(idxBlk == 0u  ||  pBlkDesc->addrFrom == flashBlockDescAry[idxBlk-1].addrTo);
# endif


    } /* for(Check flash block specification table entries for plausibility) */

# if defined(MCU_MPC5748G)
    /* For the MPC5748G, the implementation of the address range validity uses hard-coded
       address boundaries. We need to check consistency. */
    assert(rom_isValidFlashAddressRange(flashBlockDescAry[0].addrFrom, /*size*/ 0u)
           && !rom_isValidFlashAddressRange(flashBlockDescAry[0].addrFrom-1u, /*size*/ 0u)
           && rom_isValidFlashAddressRange
                                ( flashBlockDescAry[sizeOfAry(flashBlockDescAry)-1].addrTo
                                , /*size*/ 0u
                                )
           && !rom_isValidFlashAddressRange
                                ( flashBlockDescAry[sizeOfAry(flashBlockDescAry)-1].addrTo+1u
                                , /*size*/ 0u
                                )
          );
# endif

