PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
#endif /* DEBUG */

} /* eap_osInitFlashRomDriver */


/**
 * Start the erasure of one or more flash blocks in the C55 controller.
 *   The preconditions are checked (availability of controller for erasure) the wanted
 * blocks are selected and the high voltage is enabled, which makes the flash erasure
 * begin. The function is non-blocking and doesn't wait for the termination of the erasure.
 * Use eap_osGetStatusEraseFlashBlocks() to find out, when it has terminated.
 *   @return
 * Get the status of the operation. eap_osStartEraseFlashBlocks() or
 * eap_osStartProgramQuadPage() can be called earliest again when this function returns
 * either success or failure - but not yet while it reports a pending state
 * (#rom_err_processPending).
 *   @param[in] addressFrom
 * The blocks to erase are specified by the address range, which needs to become blank. All
 * flash blocks, which share at least one byte with the specified address range, will be
 * erased, all others don't. This is the first blanked address.
 *   @param[in] noBytes
 * This is the length in Byte of the address range.
 */
rom_errorCode_t eap_osStartEraseFlashBlocks(uint32_t addressFrom, uint32_t noBytes)
{
    rom_errorCode_t retCode;
    const uint32_t mcr = C55FMC->MCR;

    if(!rom_isValidFlashAddressRange(addressFrom, noBytes))
    {
        retCode = rom_err_badAddressRange;
    }

    /* To initiate erasure, no other operation must be in progress. */
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK     \
                                 |C55FMC_MCR_PGM_MASK    \
                                 |C55FMC_MCR_EHV_MASK    \
                                 |C55FMC_MCR_PSUS_MASK   \
                                 |C55FMC_MCR_ESUS_MASK   \
                                )
    else if((mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_CLEARED
    {
        /* Enable the flash blocks for erase, which are touched by the address range. */
        /* Set MCR[ERS] to start erase operation. */
        C55FMC->MCR |= C55FMC_MCR_ERS_MASK;

        enableFlashBlocks(addressFrom, noBytes, /*isErase*/ true);

        /* The interlock write needs to be done prior to enabling the high voltage. We
           need to write anywhere into a flash block to be erased. For simplicity, we
           choose the first address of the range. RM48, 74.6.1.3, p.3686, 3. */
        *(volatile uint32_t*)addressFrom = 0xFFFFFFFFu;

        /* We set MCR[EHV] to turn on the high voltage for erasing. See RM48, 74.5.1,
           p.3656. */
        C55FMC->MCR |= C55FMC_MCR_EHV_MASK;

        /* This is a non-blocking function. We don't wait for the result but will check
           it in the next clock tick. */
        retCode = rom_err_processPending;
    }
    else
    {
        /* Turn off high voltage, reset all operation request bits and lock flash blocks. */
        abortEraseAndProgram();

        retCode = rom_err_unexpectedHwState;
    }

    return retCode;

} /* eap_osStartEraseFlashBlocks */


/**
 * Check the status of an erase operation, which had been initiated before by
 * eap_osStartEraseFlashBlocks().
 *   @return
 * Get the status of the operation. eap_osStartEraseFlashBlocks() or
 * eap_osStartProgramQuadPage() can be called earliest again when this function returns
 * either success or failure - but not yet while it reports a pending state
 * (#rom_err_processPending).
 */
rom_errorCode_t eap_osGetStatusEraseFlashBlocks(void)
{
    rom_errorCode_t retCode;

    /* Did we initiate an erase operation before? Without this bit set, MCR[DONE] would be
       meaningless. */
    const uint32_t mcr = C55FMC->MCR;
    #define BITS_TO_BE_SET      (C55FMC_MCR_ERS_MASK|C55FMC_MCR_EHV_MASK)
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_PGM_MASK|C55FMC_MCR_PSUS_MASK|C55FMC_MCR_ESUS_MASK)
    if((mcr & BITS_TO_BE_SET) == BITS_TO_BE_SET  &&  (mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_SET
    #undef BITS_TO_BE_CLEARED
    {
        /* MCR[DONE] indicates completion. */
        if((mcr & C55FMC_MCR_DONE_MASK) != 0u)
        {
            /* Check MCR[PEG]. A zero bit indicates an erase error. */
            if((mcr & C55FMC_MCR_PEG_MASK) != 0u)
                retCode = rom_err_noError;
            else
                retCode = rom_err_c55FmcErrorInPeg;
        }
        else
        {
            /* MCR[DONE]=0: The operation is still in progress. We wait till next clock
               tick for the next check. */
            retCode = rom_err_processPending;
        }
    }
    else
        retCode = rom_err_unexpectedHwState;

    if(retCode != rom_err_processPending)
    {
        /* Turn off high voltage, reset all operation request bits and lock flash blocks. */
        abortEraseAndProgram();

        /* Regardless whether erasure succeeded or failed, flash ROM array contents may
           have altered and we have the (very high) risk of a D-cache inconsistency. We
           invalidate the entire cache. Note, the I-cache is no affected as we don't read
           any instruction from the erased flash blocks, whereas we will read the data for
           a blank check. */
        rtos_osInitializeDCache();
    }

    return retCode;

} /* eap_osGetStatusEraseFlashBlocks */


/**
 * Start the programming of a single quad-page in the C55 controller.\n
 *   The preconditions are checked (availability of controller for new write-page
 * operation), the write buffer is filled with the data and high voltage is enabled, which
 * makes the flash programming begin. The function is non-blocking and doesn't wait for the
 * termination of the program step. Use eap_osGetStatusProgramQuadPage() to find out, when
 * it has terminated.
 *   @return
 * Get the status: If everything succeeded, then it is pending (#rom_err_processPending),
 * otherwise an error message.
 *   @param[in] pPrgDataBuf
 * The buffer with the data to program and the target address in flash ROM.\n
 *   Caution: The buffer needs to be unmodified and available to the flash ROM driver until
 * programming of the quad-page has completed - either until
 * eap_osGetStatusProgramQuadPage() has reported the end of the operation (no matter
 * whether successful) or until the programming mode has been aborted using
 * abortEraseAndProgram().
 */
rom_errorCode_t eap_osStartProgramQuadPage(eap_quadPageProgramBuffer_t * const pPrgDataBuf)
{
    rom_errorCode_t retCode;
    const uint32_t mcr = C55FMC->MCR;

    if( EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pPrgDataBuf->address) != 0u
        || !rom_isValidFlashAddressRange(pPrgDataBuf->address, EAP_C55FMC_SIZE_OF_QUAD_PAGE)
      )
    {
        retCode = rom_err_badAddressRange;
    }

